In [1]:
import pandas as pd
df = pd.read_csv("../data/fortune1000.csv", index_col="Rank")
sectors = df.groupby(by="Sector")
df.head(3)

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000

In [4]:
sectors.sum(numeric_only=True).head(3)

                     Revenue  Profits  Employees
Sector
Aerospace & Defense   357940    28742     968057
Apparel                95968     8236     346397
Business Services     272195    28227    1361050

In [14]:
sectors[["Revenue", "Profits"]].sum().head(3)

                     Revenue  Profits
Sector
Aerospace & Defense   357940    28742
Apparel                95968     8236
Business Services     272195    28227

In [15]:
sectors["Revenue"].sum().head(3)

Sector
Aerospace & Defense    357940
Apparel                 95968
Business Services      272195
Name: Revenue, dtype: int64

In [8]:
sectors.get_group("Aerospace & Defense")["Revenue"].sum()

357940

In [11]:
df[df["Sector"] == "Aerospace & Defense"]["Revenue"].sum()

357940